/*

 @name    : 锅巴汉化 - Web汉化插件
 @author  : 麦子、JAR、小蓝、好阳光的小锅巴
 @version : V0.6.1 - 2019-07-09
 @website : http://www.g8hh.com

*/

//1.汉化杂项
var cnItems = {
    _OTHER_: [],

    //未分类：
    'Options': '选项',
    'Export': '导出',
    'Import': '导入',
    'Hard Reset': '硬重置',
    'Reset for': '重置得到 ',
    'Save': '保存',
    'Statistics': '统计',
    'You have': '你有',
    'Alphabets': '字母',
    'Currently': '当前',
    'Automator': '自动化',
    '': '',
    '': '',
    '': '',
    '': '',
    '': '',
    '': '',
    '': '',
    '': '',
    '': '',
    '': '',
    '': '',
    '': '',
    '': '',
    '': '',
    '': '',
    '': '',
    '': '',
    '': '',
    '': '',
    '': '',
    '': '',
    '': '',
    '': '',
    '': '',
    '': '',
    '': '',
    '': '',
    '': '',
    '': '',
    '': '',
    '': '',
    '': '',
    '': '',
    '': '',
    '': '',
    '': '',
    ' You have': ' 你有',
    '当前: None-None': '当前: 无-无',
    '当前: None-a': '当前: 无-a',
    'Make the next alphabet is bought automatically.': '下一个字母是自动买的。',
    'Make the next alphabet is automatically gain 10%.': '下一个字母会自动增长10%。',
    'Start to generate a.': '开始产生a。',
    'Square a production.': '平方生产。',
    'Raise a production by 1.2.': '将产量提高1.2。',
    'Raise b gain by 1.1.': '使b的收益增加1.1。',

    //原样
    '': '',
    '': '',

}


//需处理的前缀
var cnPrefix = {
    "(-": "(-",
    "(+": "(+",
    "(": "(",
    "-": "-",
    "+": "+",
    " ": " ",
    ": ": "： ",
    "\n": "",
    "                   ": "",
    "                  ": "",
    "                 ": "",
    "                ": "",
    "               ": "",
    "              ": "",
    "             ": "",
    "            ": "",
    "           ": "",
    "          ": "",
    "         ": "",
    "        ": "",
    "       ": "",
    "      ": "",
    "     ": "",
    "    ": "",
    "   ": "",
    "  ": "",
    " ": "",
    "Cost: a-": "成本: a-",
    "Cost: b-": "成本: b-",
    "Currently: ": "当前: ",
    "You have played for ": "你已经玩了 ",
    "Cost: ": "成本: ",
    "Version: ": "版本: ",
    "None-": "无-",
    "": "",
    "": "",
    "": "",
    "": "",
    "": "",
    "": "",
    "": "",
    "": "",
    "": "",
    "": "",
    "": "",
    "": "",
    "": "",
    "": "",
    "": "",
    "": "",
    "": "",
    "": "",
    "": "",
}

//需处理的后缀
var cnPostfix = {
    ":": "：",
    "：": "：",
    ": ": "： ",
    "： ": "： ",
    " ": "",
    "/s)": "/s)",
    "/s": "/s",
    ")": ")",
    "%": "%",
    "                   ": "",
    "                  ": "",
    "                 ": "",
    "                ": "",
    "               ": "",
    "              ": "",
    "             ": "",
    "            ": "",
    "           ": "",
    "          ": "",
    "         ": "",
    "        ": "",
    "       ": "",
    "      ": "",
    "     ": "",
    "    ": "",
    "   ": "",
    "  ": "",
    " ": "",
    "\n": "",
    " seconds": " 秒",
    "": "",
    "": "",
    "": "",
    "": "",
    "": "",
    "": "",
    "": "",
    "": "",
}

//需排除的，正则匹配
var cnExcludeWhole = [
    /^x?\d+(\.\d+)?[A-Za-z%]{0,2}(\s.C)?\s*$/, //12.34K,23.4 °C
    /^x?\d+(\.\d+)?(e[+\-]?\d+)?\s*$/, //12.34e+4
    /^([\d\.,]+)$/, //纯空格
    /^\s*$/, //纯空格
    /^\d+(\.\d+)?[A-Za-z]{0,2}.?\(?([+\-]?(\d+(\.\d+)?[A-Za-z]{0,2})?)?$/, //12.34M (+34.34K
    /^(\d+(\.\d+)?[A-Za-z]{0,2}\/s)?.?\(?([+\-]?\d+(\.\d+)?[A-Za-z]{0,2})?\/s\stot$/, //2.74M/s (112.4K/s tot
    /^\d+(\.\d+)?(e[+\-]?\d+)?.?\(?([+\-]?(\d+(\.\d+)?(e[+\-]?\d+)?)?)?$/, //2.177e+6 (+4.01+4
    /^(\d+(\.\d+)?(e[+\-]?\d+)?\/s)?.?\(?([+\-]?(\d+(\.\d+)?(e[+\-]?\d+)?)?)?\/s\stot$/, //2.177e+6/s (+4.01+4/s tot
];
var cnExcludePostfix = [
    /:?\s*x?\d+(\.\d+)?(e[+\-]?\d+)?\s*$/, //12.34e+4
    /:?\s*x?\d+(\.\d+)?[A-Za-z]{0,2}$/, //: 12.34K, x1.5
]

//正则替换，带数字的固定格式句子
//纯数字：(\d+)
//逗号：([\d\.,]+)
//小数点：([\d\.]+)
//原样输出的字段：(.+)
var cnRegReplace = new Map([
    [/^(.+)-([\d\.,]+)$/, '$1-$2'],
    [/^Multiply (.+) production by (.+).$/, '$1 的产量 x$2'],
    [/^Raise (.+) \& (.+) gain by (.+).$/, '提高 $1 和 $2 的收益 $3倍。'],
    [/^Gain (.+)x more (.+) \& (.+).$/, '获得 $1倍 的 $2 和 $3 。'],
    [/^Gain (.+)x more (.+).$/, '获得 $1倍 的 $2。'],
    [/^Gain (.+)x (.+).$/, '获得 $1倍 的 $2。'],
    [/^Gain more alphabets except (.+) based on unspent (.+).$/, '获得更多的字母，除了 $1 ，基于未使用的 $2。'],
    [/^Gain more previous alphabets based on unspent (.+).$/, '获得更多的前一个字母基于未使用的 $2。'],
    [/^Gain more (.+) \& (.+) alphabets based on unspent (.+).$/, '获得更多的 $1 和 $2 字母基于未使用的 $3。'],
    [/^Gain more (.+) based on unspent (.+).$/, '获得更多的 $1 基于未使用的 $2。'],
    [/^Gain more (.+) \& (.+) based on unspent (.+).$/, '获得更多的 $1 和 $2 基于未使用的 $3。'],
    [/^Multiply (.+) production based on unspent (.+).$/, '倍增 $1 的产量基于未使用的 $2'],
    [/^workers: (\d+)\/$/, '工人：$1\/'],

]);